eziya/STM32_CYCLONETCP_EXAMPLES/CycloneTCP_SSL_SSH_IPSEC_EAP_CRYPTO_Open_2_5_2/demo/st/stm32mp157c_dk2/ftp_client_demo/sw4stm32/startup_stm32mp15xx.c
//Dependencies
#include "stm32mp157cxx_cm4.h"

//Linker file constants
extern uint32_t _sidata;
extern uint32_t _sdata;
extern uint32_t _edata;
extern uint32_t _sbss;
extern uint32_t _ebss;
extern uint32_t _estack;

//Function declaration
void SystemInit(void);
void __libc_init_array(void);
int main(void);

//Default empty handler
void Default_Handler(void);

//Cortex-M4 core handlers
void Reset_Handler             (void);
void NMI_Handler               (void) __attribute__((weak, alias("Default_Handler")));
void HardFault_Handler         (void) __attribute__((weak, alias("Default_Handler")));
void MemManage_Handler         (void) __attribute__((weak, alias("Default_Handler")));
void BusFault_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void UsageFault_Handler        (void) __attribute__((weak, alias("Default_Handler")));
void SVC_Handler               (void) __attribute__((weak, alias("Default_Handler")));
void DebugMon_Handler          (void) __attribute__((weak, alias("Default_Handler")));
void PendSV_Handler            (void) __attribute__((weak, alias("Default_Handler")));
void SysTick_Handler           (void) __attribute__((weak, alias("Default_Handler")));

//Peripheral handlers
void WWDG1_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void PVD_AVD_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void TAMP_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void RTC_WKUP_ALARM_IRQHandler (void) __attribute__((weak, alias("Default_Handler")));
void RESERVED4_IRQHandler      (void) __attribute__((weak, alias("Default_Handler")));
void RCC_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void EXTI0_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void EXTI1_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void EXTI2_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void EXTI3_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void EXTI4_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream0_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream1_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream2_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream3_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream4_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream5_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream6_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void ADC1_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void FDCAN1_IT0_IRQHandler     (void) __attribute__((weak, alias("Default_Handler")));
void FDCAN2_IT0_IRQHandler     (void) __attribute__((weak, alias("Default_Handler")));
void FDCAN1_IT1_IRQHandler     (void) __attribute__((weak, alias("Default_Handler")));
void FDCAN2_IT1_IRQHandler     (void) __attribute__((weak, alias("Default_Handler")));
void EXTI5_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void TIM1_BRK_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void TIM1_UP_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void TIM1_TRG_COM_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void TIM1_CC_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void TIM2_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void TIM3_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void TIM4_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void I2C1_EV_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void I2C1_ER_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void I2C2_EV_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void I2C2_ER_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void SPI1_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void SPI2_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void USART1_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void USART2_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void USART3_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void EXTI10_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void RTC_TIMESTAMP_IRQHandler  (void) __attribute__((weak, alias("Default_Handler")));
void EXTI11_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void TIM8_BRK_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void TIM8_UP_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void TIM8_TRG_COM_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void TIM8_CC_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void DMA1_Stream7_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void FMC_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void SDMMC1_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void TIM5_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void SPI3_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void UART4_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void UART5_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void TIM6_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void TIM7_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream0_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream1_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream2_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream3_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream4_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void ETH1_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void ETH1_WKUP_IRQHandler      (void) __attribute__((weak, alias("Default_Handler")));
void FDCAN_CAL_IRQHandler      (void) __attribute__((weak, alias("Default_Handler")));
void EXTI6_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void EXTI7_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void EXTI8_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void EXTI9_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream5_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream6_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void DMA2_Stream7_IRQHandler   (void) __attribute__((weak, alias("Default_Handler")));
void USART6_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void I2C3_EV_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void I2C3_ER_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void USBH_OHCI_IRQHandler      (void) __attribute__((weak, alias("Default_Handler")));
void USBH_EHCI_IRQHandler      (void) __attribute__((weak, alias("Default_Handler")));
void EXTI12_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void EXTI13_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void DCMI_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void CRYP1_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void HASH1_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void FPU_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void UART7_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void UART8_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void SPI4_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void SPI5_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void SPI6_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void SAI1_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void LTDC_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void LTDC_ER_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void ADC2_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void SAI2_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void QUADSPI_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void LPTIM1_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void CEC_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void I2C4_EV_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void I2C4_ER_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void SPDIF_RX_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void OTG_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void RESERVED99_IRQHandler     (void) __attribute__((weak, alias("Default_Handler")));
void IPCC_RX0_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void IPCC_TX0_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void DMAMUX1_OVR_IRQHandler    (void) __attribute__((weak, alias("Default_Handler")));
void IPCC_RX1_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void IPCC_TX1_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void CRYP2_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void HASH2_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void I2C5_EV_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void I2C5_ER_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void GPU_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM1_FLT0_IRQHandler    (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM1_FLT1_IRQHandler    (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM1_FLT2_IRQHandler    (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM1_FLT3_IRQHandler    (void) __attribute__((weak, alias("Default_Handler")));
void SAI3_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM1_FLT4_IRQHandler    (void) __attribute__((weak, alias("Default_Handler")));
void TIM15_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void TIM16_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void TIM17_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void TIM12_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void MDIOS_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void EXTI14_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void MDMA_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void DSI_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void SDMMC2_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void HSEM_IT2_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void DFSDM1_FLT5_IRQHandler    (void) __attribute__((weak, alias("Default_Handler")));
void EXTI15_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void nCTIIRQ1_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void nCTIIRQ2_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void TIM13_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void TIM14_IRQHandler          (void) __attribute__((weak, alias("Default_Handler")));
void DAC_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void RNG1_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void RNG2_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void I2C6_EV_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void I2C6_ER_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void SDMMC3_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void LPTIM2_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void LPTIM3_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void LPTIM4_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void LPTIM5_IRQHandler         (void) __attribute__((weak, alias("Default_Handler")));
void ETH1_LPI_IRQHandler       (void) __attribute__((weak, alias("Default_Handler")));
void RESERVED143_IRQHandler    (void) __attribute__((weak, alias("Default_Handler")));
void MPU_SEV_IRQHandler        (void) __attribute__((weak, alias("Default_Handler")));
void RCC_WAKEUP_IRQHandler     (void) __attribute__((weak, alias("Default_Handler")));
void SAI4_IRQHandler           (void) __attribute__((weak, alias("Default_Handler")));
void DTS_IRQHandler            (void) __attribute__((weak, alias("Default_Handler")));
void RESERVED148_IRQHandler    (void) __attribute__((weak, alias("Default_Handler")));
void WAKEUP_PIN_IRQHandler     (void) __attribute__((weak, alias("Default_Handler")));

//Vector table
__attribute__((section(".isr_vector")))
const uint32_t vectorTable[166] =
{
   //Initial stack pointer
   (uint32_t) (&_estack),

   //Core handlers
   (uint32_t) Reset_Handler,
   (uint32_t) NMI_Handler,
   (uint32_t) HardFault_Handler,
   (uint32_t) MemManage_Handler,
   (uint32_t) BusFault_Handler,
   (uint32_t) UsageFault_Handler,
   (uint32_t) 0,
   (uint32_t) 0,
   (uint32_t) 0,
   (uint32_t) 0,
   (uint32_t) SVC_Handler,
   (uint32_t) DebugMon_Handler,
   (uint32_t) 0,
   (uint32_t) PendSV_Handler,
   (uint32_t) SysTick_Handler,

